{
	"_meta": {
		"sources": [
			{
				"json": "KappaArknights",
				"abbreviation": "KAHB",
				"full": "Arknights Campaign Setting",
				"authors": [
					"Kappa"
				],
				"convertedBy": [
					"Kenovs"
				],
				"version": "0.5",
				"url": "https://docs.google.com/document/d/1EJixzfYthEIKVrpb7ys3E5X3woPzHPuT/edit",
				"targetSchema": "1.0",
				"edition": "classic",
				"optionalFeatureTypes": {
					"KAHB:SBS": "Savra Bullshit",
					"KAHB:RP": "Racial Progression"
				}
			}
		],
		"dateAdded": 0,
		"dateLastModified": 0
	},
	"race": [
    {
        "name": "Archosauria",
        "source": "KappaArknights",
        "page": "20",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"weaponProficiencies": [
			{
				"simple": true,
				"martial": true
			}
		],
		"armorProficiencies": [{"shield|phb": true}],
        "traitTags": [
			"Natural Weapon"
		],
		"entries": [
			{
				"type": "entries",
				"name": "Strong Jaws",
				"entries": [
					"You gain a bite attack, which counts as an unarmed strike and deals {@damage 1d6} piercing damage. In addition, if you grapple or restrain an enemy you can use a bonus action to attack them with this bite attack. Your bite attacks have advantage against grappled targets."
				]
			},
			{
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Adept in Conflict",
                "entries": [
                    "You gain proficiency in simple and martial weapons. You also gain proficiency in shields."
                ]
            },
            {
                "type": "entries",
                "name": "Tribal Tactics",
                "entries": [
                    "You can make simple traps using your environment. The saving throw for your traps is (DC = 8 + your Wisdom + your proficiency bonus). The DC is 8 + your Proficiency bonus + your Intelligence modifier. Placing traps require 1 minute. If a creature is making a skill check to detect your traps, they make the skill check against the DC determinated by this trait. You can make up to 3 traps with this feature and carry them with yourself. You can make the following traps:",
					{"type": "list",
					"items": [
						"Tripping Trap: You make a 15-feet long 5-feet wide contraption, which you attach to two solid surfaces or onto the ground. The first time a creature enters the space of the trap they have to make a Dexterity saving throw or fall prone. After triggering this trap, it is revealed to everyone and its space becomes difficult terrain until it’s removed.",
						"Launching Trap: You make a medium sized contraption, which you place on the ground or on a solid surface. When a creature comes into contact with the trap, they must make a Strength saving throw or be knocked back into the opposite direction the trap is facing by 15 feet and are knocked prone. Only large or smaller creatures can be affected by this trap. After the trap is used, by a creature triggering it, the trap is destroyed.",
						"Restraining Trap: You place this small sized trap on the ground. Whenever a creature steps on it, it must make a Dexterity saving throw or become grappled. After they get caught in this trap, they can use their action to make an Athletics check against your trap DC to escape it. After the trap is used, by a creature triggering it or escaping from it, the trap is destroyed."
						]
					}
				]
            }
        ]
    },
	{
        "name": "Anura",
        "source": "KappaArknights",
        "page": "21",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"resist": ["posion"],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Poisonous Body and Skin",
                "entries": [
                    "Your body creates a poison unique to you and you can use this to your advantage. This trait grants you the following benefits:",
					{
						"type": "list",
						"items": [
							"Defensive Posion: Whenever a creature hits you with a melee attack, they will take poison damage equal to your proficiency bonus. If you are hit by a bite attack, they take double damage from this trait.",
							"Familiarity with Posions: You gain advantage on saving throw against being poisoned and taking poison damage.",
							"Posionproof Skin: You gain resistance to poison damage.",
							"Poisonous Contact: While you are physically grappling or restraining a creature or you are being grappled or restrained by a creature, the creature will take poison damage equal to your proficiency bonus at the start of its turn.",
							"Posion Coating: As a bonus action you can coat a melee weapon or a piece of ammunition with your poison. The coating remains on the weapon for 1 minute or until you successfully hit a creature with the weapon. On a hit the target has to make a Constitution saving throw (DC = 8 + your proficiency bonus + your Constitution modifier). On a failure the creature takes poison damage equal to your proficiency bonus and becomes poisoned until the start of your next turn. On a success, they take half damage and aren’t poisoned. You can apply this coating a number of times equal to 2 x your proficiency bonus and regain the ability to do so on a short rest.",
							"Limited Duration: Your poison loses potency after 1 minute if it loses contact with your body, making it impossible to store for later uses for other creatures."
							
						]
					}
                ]
            }
        ]
    },
	{
        "name": "Anati",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": {
			"walk": 30,
			"climb": true
		},
		"skillProficiencies": [{"acrobatics": true}],
		"toolProficiencies": [{"tinker's tools": true}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Adept Climbers",
                "entries": [
                    "You gain climbing speed equal to your movement speed."
                ]
            },
            {
                "type": "entries",
                "name": "Acrobatic Body",
                "entries": [
                    "You gain proficiency in Acrobatics. In addition, if you gain proficiency in Acrobatics from other sources, such as class or background, this trait grants you expertise instead."
					
                ]
            },
			{
				"type": "entries",
                "name": "Creators",
                "entries": [
                    "You gain proficiency with Tinker’s Tools. In addition, if you gain proficiency in Tinker’s Tool from other sources, such as class or background, this trait grants you expertise instead. Using those tools, you can spend 1 hour and 25 gp worth of materials to construct a Tiny originium device (AC 5, 1 hp). The device ceases to function if it is reduced to 0 HP or you use your Action to dismantle it; at that time, you can reclaim the materials used to create it. Whenever you create a device, choose up to 2 properties from the list below. You can choose the same property twice and gain an enchanted effect of that property. If a device can function up to a specified amount of time and have different properties, they can maintain their function separately up to the time specified to them. If you activate both properties at the same time, they will maintain function until one of them reaches their maximum function time and the device will consume both properties' functionality. If a device reaches its maximum uptime, you need to spend 10 minutes with the device to restore it to function. Whenever you create the device you determine how their functions look or sound like. If you want to modify them, like make the device create a different sound and another image, you need to spend 10 minutes of work with it. If a device requires a creature to make a saving throw, the DC is 8 + your Proficiency bonus + your Intelligence modifier. You can activate a device by touching it and must use your action to do so, but you can throw it 30 feet away with the same action.",
					{
						"type": "entries",
						"name": "Light",
						"entries": [
							"The device can emanate bright light in a 30 feet cone and dim light in an additional 30 feet up to an hour. Enchanted effect: Doubles to range of the lighting and can function until turned off. Also, you turn this device into a flashbang, which you can throw to a point within 30 feet of you. Creatures within 10 feet of that point must make a Constitution saving throw. On a failure, their next attack will be at disadvantage. After you used it this way, the device is destroyed."
						]
					},
					{
						"type": "entries",
						"name": "Sound",
						"entries": [
							"The device can create any sound up to an hour, and it can only be heard up to 60 feet. You can adjust the volume of the device. Enchanted effect: The device can operate for more than an hour now, until it is turned off and its sound can be heard up to 300 feet. You can also turn this device into a sound bomb, which you can throw to a point within 30 feet of you. Creatures within 10 feet of that point must make a Constitution saving throw or become deafened for 1 minute. After you used it this way, the device is destroyed."
						]
					},
					{
						"type": "entries",
						"name": "Image",
						"entries": [
							"The device can create a stationary image up to Small size and remains functional for up to 5 minutes. Enchanted effect: The device can create an image up to Large size and can remain functional up to an hour. The image doesn’t need to be stationary anymore."
						]
					}
					
				]
			}
        ]
    },
	{
		"name": "Ægir",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": {
			"walk": 30,
			"swim": 50
			},
		"skillProficiencies": [{"performance": true}],
		"toolProficiencies": [
			{
				"vehicles (land)": true,
				"vehicles (water)": true
			}
		],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "People of the Ocean",
                "entries": [
                    "You gain 50 feet swimming speed and the ability to breathe underwater."
                ]
            },
            {
                "type": "entries",
                "name": "Culture of Singing",
                "entries": [
                    "You gain proficiency in Performance. In addition, if you gain proficiency in Performance from other sources, such as class or background, this trait grants you expertise instead. Note that you have to manually apply that expertise."
                ]
            },
			{
				"type": "entries",
				"name": "Refugees of an Advanced Civilization",
				"entries": [
					"You gain proficiency in all land and water vehicles. In addition, you have advantage on ability checks to figure out, understand or use highly advanced technological equipment and machines."
				]
				
			},
			{
                "type": "entries",
                "name": "Unfamiliar with Originium",
                "entries": [
                    "You can use arts devices normally, as Aegirs spend enough time on land to learn and adept, but you have an alternative way to use your arts. You can ignore the somatic and material components of your spells, if they don’t require them to have an item with a specific value, and you don’t need to use arts devices anymore. However, if you forgo to use art devices, all your spells will have verbal components, as you use your song to manifest them."
                ]
            }
        ]
		
	},
	{
        "name": "Cautus",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"blindsight": 5,
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Keen Hearing",
                "entries": [
                    "You have advantage on Wisdom (Perception) checks that rely on hearing."
                ]
            },
            {
                "type": "entries",
                "name": "Perceptive Fighter",
                "entries": [
                    "You have blindsight with a range of 5 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you. You can only benefit from this trait if you aren’t deafened."
                ]
            },
			{
                "type": "entries",
                "name": "Detect",
                "entries": [
                    "You can use a bonus action to make Wisdom (Perception) checks. In addition, you can try to detect invisible creatures you are hearing within 20 feet of you. Make a Wisdom (Perception) check against the creatures Dexterity (Stealth). On a success, the other creature won’t gain any benefits for being invisible against you, but you still cannot use spells on it, if it requires you to see the target, and you can now make opportunity attacks against the creature. If the creature moves more than 20 feet away from you, it will regain the benefits of invisibility again and you need to make another skill contest following the rules of this trait again to gain the same benefit again."
                ]
            },
			{
                "type": "entries",
                "name": "Corporate Born",
                "entries": [
                    "You can add your proficiency bonus one additional time to Charisma skill check made for trading, bargaining and bribing."
                ]
            }
        ]
    },
	{
        "name": "Caprinae/Elafia",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"expertise": [{"arcana": true}],
		"additionalSpells": [
			{
				"known": {
						"1": {
							"_": [
								{
									"choose": "level=0",
									"count": 2
								}
							]
						}
					}
			}
		],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Eye for Arts",
                "entries": [
                    "You gain expertise in Arcana and you can use your spellcasting ability instead of Intelligence for such skill checks."
                ]
            },
            {
                "type": "entries",
                "name": "Expert Spellcraft",
                "entries": [
                    "Choose a spellcasting class and treat its spell list as it was part of your class’ spell list. In addition, the maximum number of spells you can learn and the maximum number of spells you can prepare are increased by your proficiency bonus. You learn two additional cantrips from the spell list that is available for you."
                ]
            },
			{
                "type": "entries",
                "name": "Spellcrafting fighting style",
                "entries": [
                    "Choose one of the following options:"
                ]
            }
        ],
		"_versions": [
			{
				"name": "Caprinae/Elafia; Defensive",
				"Source": "KappaArknights",
				"_mod": {
					"entries": {
						"mode": "replaceArr",
						"replace": "Spellcrafting fighting style",
						"items": {
							"name": "Defensive Spellcrafting Fighting Style",
							"type": "entries",
							"entries": ["While you are concentrating on a spell, you gain +1 to your saving throws."]
						}
					}
				}
			},
			{
				"name": "Caprinae/Elafia; Elementalist",
				"Source": "KappaArknights",
				"_mod": {
					"entries": {
						"mode": "replaceArr",
						"replace": "Spellcrafting fighting style",
						"items": {
							"name": "Elementalist Spellcrafting Fighting Style",
							"type": "entries",
							"entries": ["When you cast a spell that deals fire, cold, lightning or acid damage, you can switch the damage type to the other listed options. If the target of your spell had weakness to the damage type you inflicted damage with, you can roll an extra die to the damage roll, using the spells highest damage die."]
						}
					}
				}
			},
			{
				"name": "Caprinae/Elafia; Controller",
				"Source": "KappaArknights",
				"_mod": {
					"entries": {
						"mode": "replaceArr",
						"replace": "Spellcrafting fighting style",
						"items": {
							"name": "Controller Spellcrafting Fighting Style",
							"type": "entries",
							"entries": ["Once per short rest you can attempt to concentrate on two spells at the same time. While you are concentrating on two spells, your movement speed is halved and you gain a -5 penalty to your Constitution saving throws to keep your concentration. If you fail a concentration check, one of these spells ends (your choice). If you fail on the concentration check by 5 or more, you lose concentration on both spells."]
						}
					}
				}
			}
		]
    },
	{
        "name": "Draco",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"resist": ["fire"],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Draco Resistance",
                "entries": [
                    "You have resistance to fire damage. You can also spend an action to gain immunity to fire damage for 1 minute. If you use your Innate Fire Arts, you can activate this ability at the same time. Once you use this trait, you can't do so again until you finish a long rest."
                ]
            },
            {
                "type": "entries",
                "name": "Innate Fire Arts",  
                "entries": [
                    "You have been born with arts that can create and manipulate fire in many ways. You can use these arts for simple tasks. You instantaneously light or snuff out a Candle, a torch, or a small campfire. You can also set objects on fire that are not being carried or worn, but only one a scale that a cantrip would do. Alternatively, you can use these arts in combat. When you take the Attack action on your turn, you can replace one of your attacks with one of your Fire Arts presented below. Calculating the save DC and the attack roll for your arts is the same as for your spells. If you picked a class with the ability to cast spells, you use your spellcasting ability to determine the save DC and attack roll modifier, otherwise use your Constitution for this purpose. You can use your Fire Arts offensively a number of times equal to your Proficiency modifier and regain all expended uses when you finish a long rest. This trait counts as an innate ability, and not as a spell. You have the following offensive art options:",
					{
						"type": "list",
						"items": [
							"Cone of Flames: You create a 15-foot cone of fire. Creatures in that area must make a Dexterity saving throw. On a failed save they take 1d10 fire damage, or half as much on a success. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). The range of this attack also increases to a 30-foot cone when you reach 11th level",
							"Flame Path: You create a 30-foot long, 5 feet wide line of fire. Creatures in that area must make a Dexterity saving throw. On a failed save they take 1d10 fire damage, or half as much on a success. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). The range of this attack also increases to a 60-foot long, 10 feet wide when you reach 11th level.",
							"Flame Surge: You attempt to set a creature on fire. Make a ranged attack against a creature within 60 feet of you, that you can see. On a hit deal 1d10+ your Fire Art ability modifier fire damage and they are set on fire. While a creature is on fire, they will take 1d6 fire damage at the start of each of its turns. A creature can use its action to extinguish the flames. This initial damage and the continuous fire damage increase by 1d10 and 1d6 when you reach 5th level (2d10 and 2d6), 11th level (3d10 and 3d6), and 17th level (4d10 and 4d6)."
						]
					}
                ]
            }
        ]
    },
	{
        "name": "Durin",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["S"],
        "speed": 25,
		"toolProficiencies": [
			{
				"brewer's supplies": true,
				"anyArtisansTool": 2
			}
		],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Durin's are small and have a speed of 25 feet. Also they are the best and strongest race on Terra no cap."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Heavy Drinker",
                "entries": [
                    "You have advantage on ability checks and saving throws against the condition that you would get after drinking too much alcohol."
                ]
            },
            {
                "type": "entries",
                "name": "Simple Minded",
                "entries": [
                    "You have advantage on Intelligence saving throws."
                ]
            },
			{
                "type": "entries",
                "name": "Advanced Society",
                "entries": [
                    "You gain proficiency in two artisan tools of your choice."
                ]
            },
			{
                "type": "entries",
                "name": "Pacifist",
                "entries": [
                    "Whenever you try to convince another creature to avoid violence, you can add a d6 to the Charisma ability check you roll. You can use this trait after you see the result on your dice roll, but before the roll effects are calculated."
                ]
            },
			{
                "type": "entries",
                "name": "Brew Master",
                "entries": [
                    "You gain proficiency in Brewer’s Supplies. In addition, you gain the ability to brew special magical alcoholic drinks. As part of a long rest, you can start making these drinks and they will be fermented and ready at the start of the next long rest. You can only have in the making an amount of drinks at the same time equal to your proficiency bonus, but you can store as many as you like. Making these magical drinks requires 15 gp worth of materials each. A creature can consume these drinks as an action or as a bonus action. Whenever a creature consumes one of these drinks, it must make a Constitution saving throw against 8 + your proficiency bonus. On a failed save they gain the effects of the drink, but also gain the Dizzy condition that lasts as long as the drink's effect lasts. A Lesser Restoration spell can remove the Dizzy effect. On a successful save the drinks effects activates without a consumer getting Dizzy. The Dizzy condition gives the creature disadvantage on attack rolls and ability check. You have the following drink options to make:",
					{
						"type": "list",
						"items": [
							"Numbing Rum: The consumer of this drink will gain temporary hit points at the start of each of its turns equal to your proficiency bonus. It lasts a number of rounds equal to your proficiency bonus.",
							"Ale of Clarity: The consumer of this drink loses the charmed of frightened condition, but makes the Constitution saving throw against the drink with disadvantage. On a failed save, it gains the Dizzy condition for an amount of rounds equal to your proficiency bonus.",
							"Cider of Friendship: The consumer of this drink will treat the creature it received from as a close friend if it fails the Constitution saving throw. This drink's effects lasts for an hour, but creatures immune to being charmed cannot be affected by it.",
							"The Strong: The consumer of this drink must make a Constitution saving throw against 8 + 2x your proficiency bonus. On a failed save, the consumer gains the Dizzy condition for an amount of hours equal to your proficiency bonus. "
						]
					}
                ]
            }
        ]
    },
	{
        "name": "Feline",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"darkvision": 60,
		"skillProficiencies": [{"stealth": true}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Darkvision",
                "entries": [
                    "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
                ]
            },
            {
                "type": "entries",
                "name": "Keen Senses",
                "entries": [
                    "You have advantage on Wisdom (Perception) checks that rely on sight."
                ]
            },
			{
                "type": "entries",
                "name": "Quick Stand",
                "entries": [
                    "When you are prone, standing up uses only 5 feet of your movement."
                ]
            },
			{
                "type": "entries",
                "name": "Light Landing",
                "entries": [
                    "You gain resistance to fall damage if you are not wearing medium or heavy armor."
                ]
            },
			{
                "type": "entries",
                "name": "Jumper",
                "entries": [
                    "You can make standing Long and High Jumps and receive the benefits as if you moved 10 feet previously."
                ]
            },
			{
                "type": "entries",
                "name": "Stealthy",
                "entries": [
                    "You gain proficiency in Stealth. In addition, if you gain proficiency in Stealth from other sources, such as class or background, this trait grants you expertise instead."
                ]
            }
        ]
    },
	{
        "name": "Forte",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"toolProficiencies": [
		{
			"calligrapher's supplies": true,
			"smith's tools": true
		}
		],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Heroic Fortitude",
                "entries": [
                    "If damage reduces you to 0 Hit Points, you must make a Constitution saving throw with a DC of 5+the damage taken (calculated from the original damage, not considering damage reduction and resistance), unless the damage is from a critical hit. On a success, you drop to 1 hit point instead. After each success, the DC is increased by 5 each time and resets after a long rest."
                ]
            },
            {
                "type": "entries",
                "name": "Forte Vitality",
                "entries": [
                    "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
                ]
            },
			{
                "type": "entries",
                "name": "Art of the Hammer and Pen",
                "entries": [
                    "You gain proficiency in calligrapher's supplies and smith’s tools. When you reach 5th level, you gain expertise in these tools. Not that you have to manually add those"
                ]
            },
			{
                "type": "entries",
                "name": "Mastercraft Modifications",
                "entries": [
                    "As part of a long rest, you can give a weapon or a piece of armor a +1 to attack and damage roll or +1 to AC, provided you have smith’s tools at your disposal. This does not make the weapon or the armor magical, and you cannot apply this trait on magical weapons. You can only have one item modified this way at the same time. After you reach 5th level, you can apply this trait to magical weapons as well."
                ]
            }
        ]
    },
	{
        "name": "Kuranta",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 45,
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Speed",
                "entries": [
                    "Your speed is 45 feet"
                ]
            },
            {
                "type": "entries",
                "name": "Rush",
                "entries": [
                    "You can run at your maximum speed without any penalties up to a number of hours equal to your Constitution modifier. In a chase, you don’t need to roll Constitution saving throws to use the Dash action and can use it any number of times if the duration of the chase is less than the limit of this trait. In addition, if you choose the Forced March option while traveling, you don’t need to roll Constitution saving throws against exhaustion if the duration of the Forced March is less than or equal to the number of hours this trait provides."
                ]
            },
			{
                "type": "entries",
                "name": "Bash",
                "entries": [
                    "If you move 20 feet or more in a straight line and hit an enemy with a melee attack originating from you, you can try to Shove the creature as part of that attack. This feature doesn't work with the Thorn Whip spell."
                ]
            },
			{
                "type": "entries",
                "name": "Precise Maneuvres",
                "entries": [
                    "Enemies have disadvantage on opportunity attacks against you."
                ]
            }
        ]
    },
	{
        "name": "Liberi",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"skillProficiencies": [{"any": 1}],
		"toolProficiencies": [{"any": 1}],
		"languageProficiencies": [{"any": 1}],
		"feats": [
				{
					"any": 1
				}
			],
		"weaponProficiencies": [
			{
				"martial": true
			}
		],
		"armorProficiencies": [{
			"shield|phb": true,
			"light": true,
			"medium": true
			}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Skilled",
                "entries": [
                    "You gain proficiency in one skill, one tool and one language of your choice. Instead of a tool proficiency, you can choose proficiency in one type of vehicle (default options only)."
                ]
            },
            {
                "type": "entries",
                "name": "Specialisation",
                "entries": [
                    "You gain a feat of your choice"
                ]
            },
			{
                "type": "entries",
                "name": "Training",
                "entries": [
                    "You gain proficiency in light and medium armor and shield. You also gain proficiency in martial weapons. If you would gain proficiency in all of these from other sources, you gain proficiency in a singular firearm of your choice."
                ]
            },
			{
                "type": "entries",
                "name": "Quick Adaptation",
                "entries": [
                    "You can prevent your d20 roll from being affected by advantage and disadvantage. This trait only works on yourself and you must declare to use it before the roll. You can use this ability a number of times equal to your proficiency bonus and regain all uses upon completing a long rest."
                ]
            }
        ]
    },
	{
        "name": "Lung",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"additionalSpells": [
			{
				"innate": {
					"3": {
						"daily": {
						"1": [{
							"choose": "level=1|class=Wizard|components & miscellaneous=concentration"
						}]
						}
						},
					"5": {
						"daily": {
						"1": [
							{
								"choose": "level=2|class=Wizard|components & miscellaneous=concentration"
							}
							]
							}
					}
				},
				"known": {
							"1": {
								"_": [
									{
										"choose": "level=0|class=Wizard"
									}
								]
							}
						}
			}
		],
		"expertise": [{"any": 1}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Expertise",
                "entries": [
                    "Choose a skill you are proficient in. You gain expertise in that skill."
                ]
            },
            {
                "type": "entries",
                "name": "Basic Arts",
                "entries": [
                    "You learn a wizard cantrip of your choice. When you reach 3rd level, you learn a 1st level wizard spell of your choice, that requires concentration, and you can cast this spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you learn a 2nd level wizard spell of your choice, that requires concentration, and you can cast this spell once with this trait and regain the ability to do so when you finish a long rest or you can use your spell slots to cast them again. These spells are added to your spell list, are always prepared and don't count against the maximum number of spells you can prepare. If you picked a caster class, use that class's spellcasting modifier to determine the spell attack bonus and spell save DC, otherwise use Intelligence for these purposes."
                ]
            },
			{
                "type": "entries",
                "name": "Traditional Fighting Style",
                "entries": [
                    "When you hold a melee weapon in one hand and no other weapon in the other you gain +1 to spell attack rolls. While you are concentrating on a spell, you gain +1 to attack and damage rolls made with melee weapon and melee spell attacks. You can use a melee weapon's versatile property and still gain the benefit of this trait. Your spells that require a melee attack don't require material components anymore if you have a melee weapon in hand."
                ]
            },
            {
                "type": "entries",
                "name": "Specialized Fighting Style",
                "entries": [
                    "You learn one {@filter Fighting Style|optionalfeatures|Feature Type=FS:F} option of your choice from the fighter class. You have to add it manually."
                ]
            }
        ]
    },
	{
        "name": "Lupo/Perro/Vulpo",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				},
				"dex": 1
			}
		],
        "size": ["M"],
        "speed": 30,
		"skillProficiencies": [{"acrobatics": true}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Dexterous",
                "entries": [
                    "Your Dexterity Score is increased by 1"
                ]
            },
            {
                "type": "entries",
                "name": "",
                "entries": [
                    ""
                ]
            },
			{
                "type": "entries",
                "name": "Acrobatic Body",
                "entries": [
                    "You gain proficiency in Acrobatics. In addition, if you gain proficiency in Acrobatics from other sources, such as class or background, this trait grants you expertise instead."
                ]
            },
			{
                "type": "entries",
                "name": "Keen Smell",
                "entries": [
                    "You have advantage on Wisdom (Perception) checks that rely on smell"
                ]
            },
			{
                "type": "entries",
                "name": "Pack Tactics",
                "entries": [
                    "You have advantage on attack rolls against enemy creatures if at least one of your allies is within 5 feet of the target creature and the ally isn't incapacitated. You can benefit from this trait once per turn. If you gain advantage from other sources, you can instead use this trait to deal extra damage to the target. The extra damage is 1d4 at 1st level, will increase by 1 addition die every 3 level after that (2d4 at 4th level, 3d4 at 7th level, 4d4 at 10th level, 5d4 at 13th level, 6d4 at 16th level and 7d4 at 19th level)."
                ]
            }
        ]
    },
	{
        "name": "Oni",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"darkvision": 60,
		"skillProficiencies": [{"athletics": true}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Darkvison",
                "entries": [
                    "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
                ]
            },
            {
                "type": "entries",
                "name": "Powerful Build",
                "entries": [
                    "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift. In addition, you can now attempt to grapple or shove a creature two sizes larger than you."
                ]
            },
			{
                "type": "entries",
                "name": "Athletics Proficency",
                "entries": [
                    "You gain proficiency in Athletics. In addition, if you gain proficiency in Athletics from other sources, such as class or background, this trait grants you expertise instead."
                ]
            },
			{
                "type": "entries",
                "name": "Rapid Regeneration",
                "entries": [
                    "You regenerate your missing hit point at the start of each of your turns if you still have remaining hit points. The amount equals your proficiency bonus, but taking necrotic damage will stop you from regenerating hit points until the end of your next turn. If you drop down to 0 hit points, you lose this regeneration until you gain more than 1 hit point and become conscious. This trait can heal you up to half of your maximum hit point. After you reach 11th level, this trait can heal you to your maximum hit point instead. In addition, you can spend your hit dice to heal in the middle of combat as a bonus action. You can choose to spend a number of hit dice up to your proficiency bonus at the same time, but you cannot add your Constitution modifier to it if you spent it this way. On a short rest, you regain spent hit dice equal to your Constitution modifier and on a long rest you regain all spend hit dice."
                ]
            }
        ]
    },
	{
        "name": "Pythia",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": {
			"walk": 30,
			"climb": true
			},
		"skillProficiencies": [{"deception": true}],
		"darkvision": 60,
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Deceptive",
                "entries": [
                    "You gain proficiency in Deception. In addition, if you gain proficiency in Deception from other sources, such as class or background, this trait grants you expertise instead."
                ]
            },
            {
                "type": "entries",
                "name": "Darkvision",
                "entries": [
                    "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
                ]
            },
			{
                "type": "entries",
                "name": "Climber",
                "entries": [
                    "You gain climbing speed equal to your walking speed."
                ]
            },
			{
                "type": "entries",
                "name": "Strong Tail",
                "entries": [
                    "Your tail counts as a limb. You can hold weapons and shields in it, but it cannot hold a two-handed weapon and it cannot help you gain the benefit from a versatile weapons two-handed attack. It counts as a natural weapon that can deal 1d6 + your Strength modifier bludgeoning damage. In addition, you can use it to grapple an additional creature, provided you don’t hold anything in your tail. If you successfully grapple a creature with your tail, the target becomes restrained while it is grappled. You can only restrain targets in this way that are in the same size category or smaller than you are."
                ]
            }
        ]
    },
	{
        "name": "Rebbah",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"skillProficiencies": [
			{
				"deception": true,
				"intimidation": true,
				"persuasion": true
			}
		],
		"toolProficiencies": [{"anyArtisansTool": 1}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Manipulative",
                "entries": [
                    "You gain proficiency in Deception, Intimidation and Persuasion. In addition, if you gain proficiency in any of these skills from other sources, such as class or background, this trait grants you expertise instead."
                ]
            },
            {
                "type": "entries",
                "name": "Brash Nature",
                "entries": [
                    "You gain advantage on saving throws against being charmed or frightened."
                ]
            },
			{
                "type": "entries",
                "name": "Leader",
                "entries": [
                    "You can inspire your allies with great words. You can use a bonus action to give a d4 to an ally. That d4 can be used to any d20 roll within the next minute, otherwise it is lost. You can use this feature a number of times equal to your proficiency bonus. You regain any expended uses when you finish a long rest."
                ]
            },
			{
                "type": "entries",
                "name": "Scrap for profit",
                "entries": [
                    "You gain proficiency in an artisan’s tool of your choice. In addition, you can attempt to recover and fix equipment you find during your travels that would be deemed not in good enough condition to use or sell, such as equipment used by monsters. You first need to examine the equipment with a successful investigation check to determine if it’s beyond recovery or not and after that you will need a successful artisan’s tools check and some material for the repair to be done. If you would need more than half the full price of the complete item to fix a recovered item, it cannot be repaired by this feature. Upon failing the investigation check, you deem the equipment beyond recovery, and upon failing the artisan’s tool check, you waste the materials used, but repair the item to one level better condition, but cannot repair it beyond barely damage with a failed save. Attempting to repair an item takes one hour, which can be done as part of the long rest’s light activity. You can only attempt to do this if you have the appropriate artisan’s tool proficiency for the item, smith’s tools for weapons made of metal, medium and heavy armor, leatherworker's tools for light armor and general clothing, woodcarver’s tool for wooden items, tinker’s tool for firearms and intricate devices. You cannot recover and fix magic items with this trait, only mundane equipment.To determinate material costs, use item prices set by the Player’s Handbook.",
					{
						"type": "table",
						"colLabels": [
							"Condition",
							"Investigation DC",
							"Artisan's Tool DC",
							"Material Cost; % of original price"
						],
						"rows": [
							[
								"Barely Damaged",
								"5",
								"10",
								"10%"
							],
							[
								"Moderatly Damaged",
								"10",
								"15",
								"25%"
							],
							[
								"Badly Damaged",
								"15",
								"20",
								"50%"
							]
						]
					}
				]
			}
					
        ]
    },
	{
        "name": "Sankta",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"weaponProficiencies": [{"firearms": true}],
		"skillProficiencies": [{"arcana": true}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Firearm Proficency",
                "entries": [
                    "You gain proficiency in all firearms."
                ]
            },
            {
                "type": "entries",
                "name": "Masters of Arts",
                "entries": [
                    "You gain proficiency in Arcana. If you picked a fullcaster class you gain expertise instead."
                ]
            },
			{
                "type": "entries",
                "name": "Arts and Bullets",
                "entries": [
                    "You can deliver your spells through a firearm's bullets. Doing so will consume 1 unit of ammunition to deliver a spell and you must make an attack roll against a target with your firearm. On a hit, you deal damage with your firearm to it and the spell will be cast on the target or centered on it. If a spell can target multiple targets through multiple attack rolls, you can consume additional units of ammunition to deal your firearms damage with each successful hit. If your bullets miss, it fails to deliver the spell and it is wasted."
                ]
            },
			{
                "type": "entries",
                "name": "'Empathy'",
                "entries": [
                    "You can detect the presence of any sankta within 60 feet of you. You can also feel the emotional state of sankta within this radius. In addition, if you cast a spell or use an ability that can read a creature’s mind, detect lies or make a telepathical connection, you can force those upon another sankta and they will automatically fail the saving throw if given any. This effect also applies to you."
                ]
            },
			{
                "type": "entries",
                "name": "Oripathy Resistance",
                "entries": [
                    "You have advantage on skill checks and saving throws against effects that would cause you to become infected or worsens your infection."
                ]
            },
			{
                "type": "entries",
                "name": "Bound by The Law",
                "entries": [
                    "Sanktas are bound since birth by The Law and if they broke it without permission they will be judged and may become a Fallen. Using your patron firearm against another sankta, taking actions that endanger the continued existence of the sankta or getting infected will attract The Laws judgement upon the sankta."
                ]
            },
			{
			
                "type": "entries",
                "name": "Becoming Fallen",
                "entries": [
                    "Upon being banished by The Law, you will lose your “Empathy” and Firearm Proficiency traits. Your halo and wings will deform and you cannot gain proficiency in firearms by any means."
                ]
            }
        ]
    },
	{
        "name": "Sarkaz",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"additionalSpells": [
			{
				"innate": {
					"1": {
						"daily": {
						"1": [{
							"choose": "level=1|class=Sorcerer;Warlock"
						}]
						}
						},
					"3": {
						"daily": {
						"1": [{
							"choose": "level=2|class=Sorcerer;Warlock"
						}]
						}
						},
					"5": {
						"daily": {
						"1": [
							{
								"choose": "level=3|class=Sorcerer;Warlock"
							}
							]
							}
					}
				},
				"known": {
							"1": {
								"_": [
									{
										"choose": "level=0|class=Sorcerer;Warlock",
										"count": 2
									}
								]
							}
						}
			}
		],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Originium Arts Resistance",
                "entries": [
                    "You have advantage on saving throws against spells and magical effects."
                ]
            },
            {
                "type": "entries",
                "name": "Relentess Endurance",
                "entries": [
                    "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest."
                ]
            },
			{
                "type": "entries",
                "name": "Ancient Sarkaz Witchcraft",
                "entries": [
                    "You gain the ability to learn ancient and very powerful ritual spells known as Sarkaz Witchcraft. Throughout the campaign you can discover and learn these spells, however, you don’t start with any of these spells. You can use your spellcasting ability for these spells, are always prepared and don't count against spells known and maximum number of spells you can prepare. If you didn’t pick a spellcasting class, use Constitution for these spells. In addition, these spells are designed specifically for the use of Sarkaz and so you gain advantage on all ability checks associated with them, like discovering, recalling information or learning them."
                ]
            },
			{
                "type": "entries",
                "name": "Born Caster",
                "entries": [
                    "You can choose two cantrips of your choice from the sorcerer and warlock spell lists. In addition, you can choose one 1st level spell at level one, a 2nd level spell when you reach level three and a 3rd level spell when you reach level five from the same spell lists. If you have a spellcasting class, use your spellcasting ability for those spells, they are added to your spell list and don't count against the maximum number of spells known and they are always prepared. Otherwise use Constitution as spellcasting ability for those spells. If you start without a spellcasting class, but you multiclass into one or more later, use the first caster class’s spellcasting ability for these spells you multiclassed into. You can use these leveled spells once per long rest for free, after that you can spend spell slots to cast them again."
                ]
            },
			{
                "type": "entries",
                "name": "Oripathy Susceptibility",
                "entries": [
                    "You have disadvantage on skill check and saving throws against effects that would cause you to become infected or worsens your infection."
                ]
            }
        ]
    },
	{
        "name": "Ursus",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				},
				"str": 1
			}
		],
        "size": ["M"],
        "speed": 30,
		"resist": ["cold"],
		"savingThrowProficiencies": [{"con": true}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Exceptional Strength",
                "entries": [
                    "Your Strength Score is increased by 1"
                ]
            },
            {
                "type": "entries",
                "name": "Cold Resistance",
                "entries": [
                    "You have resistance to cold damage."
                ]
            },
			{
                "type": "entries",
                "name": "Perservance",
                "entries": [
                    "When you are subjected to an effect that allows you to make a Constitution saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
                ]
            },
			{
                "type": "entries",
                "name": "Enduring Body",
                "entries": [
                    "You gain proficiency in Constitution saving throws. If you gain proficiency in Constitution saving throws from other sources, you also gain proficiency in death saving throws and you can roll an extra 1d4 to all of your Constitution saving throws."
                ]
            }
        ]
    },
	{
        "name": "Vouivre",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"skillProficiencies": [{"athletics": true}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Powerful Build",
                "entries": [
                    "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift. In addition, you can now attempt to grapple or shove a creature two sizes larger than you."
                ]
            },
            {
                "type": "entries",
                "name": "Athletics Proficiency",
                "entries": [
                    "You gain proficiency in Athletics. In addition, if you gain proficiency in Athletics from other sources, such as class or background, this trait grants you expertise instead."
                ]
            },
			{
                "type": "entries",
                "name": "Resilient Body",
                "entries": [
                    "You reduce any slashing, piercing and bludgeoning damage you take by an amount equal to your proficiency bonus."
                ]
            },
			{
                "type": "entries",
                "name": "Controlled Metabolism",
                "entries": [
                    "Your body needs triple the amount of time before you suffer any effect of not consuming food and water. You can go 3 + (2 x you Constitution modifier) days without consuming food and 3 days without taking in water. In addition, whenever a spell or effect would cause you to become poisoned or dizzy, you can suppress that condition by a number of turns equal to your Constitution modifier, but the duration of that effect is also increased by that amount."
                ]
            },
			{
                "type": "entries",
                "name": "Suppressive",
                "entries": [
                    "Whenever you shove a creature, you can shove it 10 feet instead of 5 feet. In addition, if you grapple a creature, you can use half of your maximum movement to drop the creature prone."
                ]
            }
        ]
    },
	{
        "name": "Zalak",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"darkvision": 120,
		"skillProficiencies": [{"perception": true}],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Darkvision",
                "entries": [
                    "You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can discern color in darkness."
                ]
            },
            {
                "type": "entries",
                "name": "Perceptive",
                "entries": [
                    "You gain proficiency in Perception. In addition, if you gain proficiency in Perception from other sources, such as class or background, this trait grants you expertise instead."
                ]
            },
			{
                "type": "entries",
                "name": "Eye for Detail",
                "entries": [
                    "You have advantage on Perception checks. In addition, you can use a bonus action to make a Perception check. You can make a Perception check against a target and it has to make a Deception check. If you succeed, your next attack against that target can add your proficiency bonus as bonus damage. You can use this ability an amount of times equal to your proficiency bonus and regain all expended uses on a short rest."
                ]
            },
			{
                "type": "entries",
                "name": "Sensory Reflex",
                "entries": [
                    "Whenever a spell or effect would inflict blindness or deafness on you and allow you to make a saving throw against it, you gain advantage on the saving throw."
                ]
            }
        ]
    },
	{
        "name": "Savra",
        "source": "KappaArknights",
        "page": "",
        "ability": [
			{
				"choose": {
					"weighted": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"weights": [
							2,
							1
						]
					}

				}
			}
		],
        "size": ["M"],
        "speed": 30,
		"optionalfeatureProgression": [
			{
				"name": "Savra Biological Traits",
				"featureType": ["KAHB:SBS"],
				"progression": {"0": 4}
			}
		],
        "entries": [
            {
				"type": "entries",
				"name": "Size",
				"entries": [
					"Terran races vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
				]
			},
			{
				"type": "entries",
				"name": "Age",
				"entries": ["Age works strangely in this setting, as all races have the normal human lifespan, but it can be longer than that by quite a lot of means. Someone can be naturally long living, some casters managed to prolong their life and many other unexplained ways, and it is not race dependent, as it is observed in most of the races in Terra. Note that, in this setting the longer a person lived, the more powerful it become and the more secrets it holds, so discuss the age of your character with your DM carefully."]
			},
			{
                "type": "entries",
                "name": "Biological Traits",
                "entries": [
                    "Choose 4 trait from the following list as your unique racial traits."
                ]
            }
        ]
    }
	],
	"class": [
	{
		"name": "CombatMedic",
		"source": "KappaArknights",
		"page": 54,
		"hd": {
			"number": 1,
			"faces": 6
		},
		"multiclassing": {
				"requirements": {
					"int": 13
				}
		},
		"proficiency": ["con", "int"],
		"startingProficiencies": {
			"armor": ["light"],
			"weapons": ["simple"],
			"skills": [{
				"any": 2
			}],
			"tools": ["herbalism kit"]
		},
		"casterProgression": "full",
		"spellcastingAbility": "int",
		"classTableGroups": [
				{
					"colLabels" : ["Empowerment Points"],
					"rows": [
						[0],
						[2],
						[3],
						[4],
						[5],
						[6],
						[7],
						[8],
						[9],
						[15],
						[16],
						[17],
						[18],
						[19],
						[20],
						[21],
						[27],
						[28],
						[29],
						[30]
					]
				},
				{
					"colLabels": [
						"{@filter Cantrips Known|spells|level=0|class=CombatMedic}"
					],
					"rows": [
						[
							3
						],
						[
							3
						],
						[
							3
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						]
					]
				},
				{
					"title": "Spell Slots per Spell Level",
					"colLabels": [
						"{@filter 1st|spells|level=1|class=CombatMedic}",
						"{@filter 2nd|spells|level=2|class=CombatMedic}",
						"{@filter 3rd|spells|level=3|class=CombatMedic}",
						"{@filter 4th|spells|level=4|class=CombatMedic}",
						"{@filter 5th|spells|level=5|class=CombatMedic}",
						"{@filter 6th|spells|level=6|class=CombatMedic}",
						"{@filter 7th|spells|level=7|class=CombatMedic}",
						"{@filter 8th|spells|level=8|class=CombatMedic}",
						"{@filter 9th|spells|level=9|class=CombatMedic}"
					],
					"rows": [
						[
							2,
							0,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							3,
							0,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							2,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							2,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							1,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							2,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							1,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							1,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							1,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							1,
							1
						],
						[
							4,
							3,
							3,
							3,
							3,
							1,
							1,
							1,
							1
						],
						[
							4,
							3,
							3,
							3,
							3,
							2,
							1,
							1,
							1
						],
						[
							4,
							3,
							3,
							3,
							3,
							2,
							2,
							1,
							1
						]
					]
				}
			],
		"cantripProgression": [
			3,
			3,
			3,
			4,
			4,
			4,
			4,
			4,
			4,
			5,
			5,
			5,
			5,
			5,
			5,
			5,
			5,
			5,
			5,
			5
		],
		"preparedSpells": "<$level$> + <$int_mod$>",
		"preparedSpellsChange": "restLong",
		"classSpells": [
			"Blade Ward",
			"Dancing Lights",
			"Encode Thoughts|GGR",
			"Friends",
			"Guidance",
			"Mage Hand",
			"Message",
			"Mind Sliver|TCE",
			"Minor Illusion",
			"Prestidigitation",
			"Resistance",
			"Sapping Sting|EGW",
			"Shocking Grasp",
			"Spare the Dying",
			"Thaumaturgy",
			"Vicious Mockery",
			"Alarm",
			"Bane",
			"Bless",
			"Cause Fear|XGE",
			"Charm Person",
			"Command",
			"Comprehend Languages",
			"Cure Wounds",
			"Detect Evil and Good",
			"Detect Magic",
			"Detect Poison and Disease",
			"Disguise Self",
			"Expeditious Retreat",
			"Feather Fall",
			"Gift of Alacrity|EWG",
			"CM Healing Word|KappaArknights",
			"Heroism",
			"Identify",
			"Inflict Wounds",
			"Jump",
			"Longstrider",
			"Mage Armor",
			"Purify Food and Drink",
			"Ray of Sickness",
			"Sanctuary",
			"Shield",
			"Shield of Faith",
			"Sleep",
			"Aid",
			"Alter Self",
			"Arcane Lock",
			"Barskin",
			"Blindness/Deafness",
			"Blur",
			"Borrowed Knowledge|SCC",
			"Calm Emotions",
			"Crown of Madness",
			"Darkvision",
			"Detect Thoughts",
			"Enhance Ability",
			"Enlarge/Reduce",
			"Enthrall",
			"Fortune's Favor|EWG",
			"Gentle Repose",
			"CM Healing Spirit|KappaArknights",
			"Hold Person",
			"Invisibility",
			"Kinetic Jaunt|SCC",
			"Lesser Restoration",
			"Magic Mouth",
			"Mind Spike|XGE",
			"Mirror Image",
			"Misty Step",
			"Prayer of Healing",
			"Protection from Poison",
			"Ray of Enfeeblement",
			"See Invisibility",
			"Spider Climb",
			"Suggestion",
			"Tasha's Mind Whip|TCE",
			"Animate Dead",
			"CM Aura of Vitality|KappaArknights",
			"Beacon of Hope",
			"Catnap|XGE",
			"Counterspell",
			"Dispel Magic",
			"Enemies Abound|XGE",
			"Fast Friends|AI",
			"Fear",
			"Feign Death",
			"Fly",
			"Glyph of Warding",
			"Haste",
			"Hypnotic Pattern",
			"Incite Greed|AI",
			"Intellect Fortress|TCE",
			"Life Transference|XGE",
			"CM Mass Healing Word|KappaArknights",
			"Remove Curse",
			"Revivify",
			"Sending",
			"Slow",
			"Speak with Dead",
			"Tongues",
			"Water Breathing"
		],
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a {@item quarterstaff|phb} or (b) a {@item dagger|phb}",
				"(a) a {@item component pouch|phb} or (b) an {@item arcane focus|phb}",
				"(a) a {@item scholar's pack|phb} or (b) an {@item explorer's pack|phb}",
				"A {@item spellbook|phb}"
			],
			"defaultData": [
				{
					"a": [
						"quarterstaff|phb"
					],
					"b": [
						"dagger|phb"
					]
				},
				{
					"a": [
						"component pouch|phb"
					],
					"b": [
						{
							"equipmentType": "focusSpellcastingArcane"
						}
					]
				},
				{
					"a": [
						"scholar's pack|phb"
					],
					"b": [
						"explorer's pack|phb"
					]
				},
				{
					"_": [
						"spellbook|phb"
					]
				}
			]
		},
		"classFeatures": [
			"Spellcasting|CombatMedic|KappaArknights|1",
			"Training in Magic and Healing|CombatMedic|KappaArknights|1",
			"Healing Empowerment|CombatMedic|KappaArknights|2",
			"Quickened Healing|CombatMedic|KappaArknights|3",
			"Ability Score Improvement|CombatMedic|KappaArknights|4",
			"Ward of Life|CombatMedic|KappaArknights|6",
			"Ability Score Improvement|CombatMedic|KappaArknights|8",
			"Healing Empowerment|CombatMedic|KappaArknights|10",
			"Ability Score Improvement|CombatMedic|KappaArknights|12",
			"Medical Reassurance|CombatMedic|KappaArknights|14",
			"Ability Score Improvement|CombatMedic|KappaArknights|16",
			"Healing Empowerment|CombatMedic|KappaArknights|17",
			"Glyph of Persistence|CombatMedic|KappaArknights|18",
			"Ability Score Improvement|CombatMedic|KappaArknights|19",
			"Sanctuary of Life|CombatMedic|KappaArknights|20"
		]
	}
	],
	"classFeature": [
		{
			"name": "Spellcasting",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 1,
			"entries": [
				"Your studies focused on the anatomy of bodies and their restoration allows you to cast combat medic spells. As a trained caster your studies are not limited and can focus your training in other fields of magic, although you can possibly learn anything, it requires extensive study and learning.",
				"Spell List: Combat medics have their own spell list provided at the end of this class’ description.",
				"Cantrips: At 1st level, you know three cantrips of your choice from the combat medic spell list. You learn additional combat medic cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Combat Medic table.",
				"Spelbook At 1st level, you have a spellbook containing your spells. You might find other spells during your adventures. When you find a spell of 1st level or higher, you can add it to your spellbook if it is of a level for which you have spell slots and if you can spare the time to decipher and copy it. The spell can be from any spell list, and upon successfully learning and copying it into your spellbook it becomes a combat medic spell for you. For each level of the spell, the process takes 8 hours and costs 150 gp. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it. Once you have spent this time and money, you can prepare the spell just like your other spells. If you try to copy spells that deal damage in any way, you need to spend four times the amount of gold and time to copy them into your spellbook, but if you try to copy a spell that can heal in any ways, you only need half the time and gold amount you would need.",
				"Spell Slots: The Combat Medic table shows how many spell slots you have to cast your combat medic spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. You prepare the list of combat medic spells that are available for you to cast, choosing from the combat medic spell list. When you do so, choose a number of combat medic spells equal to your Intelligence modifier + your combat medic level (minimum of one spell). The spells must be of a level for which you have spell slots. For example, if you are a 3rd-level combat medic, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. You can change your list of prepared spells when you finish a long rest. Preparing a new list of combat medic spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least 1 minute per spell level for each spell on your list.",
				"Spellcasting Ability: Intelligence is your spellcasting ability for your combat medic spells. The power of your spells comes from extensive study and learning. You use your Intelligence whenever a combat medic spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a combat medic spell you cast and when making an attack roll with one.",
				"Spell save DC = 8 + your proficiency bonus + your Intelligence modifier",
				"Spell attack modifier = your proficiency bonus + your Intelligence modifier",
				"Ritual Casting: You can cast a combat medic spell as a ritual if that spell has the ritual tag and you have the spell prepared.",
				"Spellcasting Focus: You can use an arcane focus as a spellcasting focus for your combat medic spells."
			]
		},
		{
			"name": "Training in Magic and Healing",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 1,
			"entries": [
				"You gain proficiency in Arcana and Medicine. You can use your Intelligence instead of your Wisdom when making Medicine checks.",
				"In addition, healing spells work differently for you, as you were trained to maximize their effectiveness. These spells and their descriptions are listed at the end of this class’ description."
			]
		},
		{
			"name": "Healing Empowerment",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 2,
			"entries": [
				"At 2nd level, you begin to manipulate your healing spells in the heat of combat to help your allies overcome any situation. You have a pool of empowerment points that you can use, starting with 2 points, and you gain more as you reach higher levels, as shown in the Empowerment Points column of the Combat Medic table. You can never have more empowerment points than shown on the table for your level. You can only use your empowerment point on spells that heal or grant temporary hit points. You can use multiple options at the same time, spending empowerment points following the rules of each option. You regain all spent empowerment points when you finish a long rest.",
				"At level 10 and 17, your pool of empowerment points will increase by 5 each. This increase is represented in the Empowerment Points column of the Combat Medic table.",
				"Flexible Casting: You can use your empowerment points to cast spells that can heal or grant temporarily hit points. To do so, expand empowerment points equal to the spell level you are casting it. By doing so you will use your action or bonus action according to the spells casting time and it will count as you would normally cast a spell.",
				"Empowerment Options:",
				{
					"type": "list",
					"items": [
						"Reflex Enhancement: By spending 1 empowerment point, you can grant the target +2 to its AC until the start of your next turn. If your spell has multiple targets, you can spend 1 additional empowerment point for each additional target you wish to be affected.",
						"Cleansing: If the target is affected by an effect that lets it do a saving throw against it, you can spend 1 empowerment point to let the target immediately roll another saving throw against that effect. If your spell has multiple targets, you can spend 1 additional empowerment point for each additional target you wish to be affected. You can only use this option, if the effect lasts 1 hour or less.",
						"Protection: You can grant the target temporary hit points equal to your Intelligence modifier x empowerment points spent. If your spell has multiple targets, you can distribute these temporary hit points between them however you like. The temporary hit points lasts until the next long rest.",
						"Inspiration: You can spend 2 empowerment points to grant the target the effects of the Bless spell until the start of your next turn. If your spell has multiple targets, you can spend 2 additional empowerment points for each additional target you wish to be affected. When you reach level 10 in this class the extra dice will become a d6 instead of a d4, and at level 17 it will become a d8.",
						"Sanctuary: You can spend 2 empowerment points to grant the target the effects of the Sanctuary spell until the start of the target's next turn. The spell save DC is your spell save DC. If your spell has multiple targets, you can spend 2 additional empowerment points for each additional target you wish to be affected."
					]
				}
				
			]
		},
		{
			"name": "Quickened Healing",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 3,
			"entries": [
				"At 3rd level, you learn how to infuse your healing magic into other spells or make them extra effective. You can manipulate the casting time of your healing spells if they have a casting time of an action or bonus action and they heal or grant temporary hit points. You can cast these spells with a casting time of an action as a bonus action and vice versa.",
				"In addition, you can cast more than one spell of 1st level or higher in your turn, but only if both of these spells heal or grant temporary hit points. You will still need to follow the other rules of spellcasting."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 4,
			"entries": [
				"When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Ward of Life",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 6,
			"entries": [
				"After you reach 6th level, you learn to reuse the fragments of your healing magic. You gain a pool of magical ward. This pool has a maximum capacity of 3 times of your combat medic level. As a reaction you can project this ward on yourself or another creature within 30 feet of you that you can see when they receive damage and reduce that damage by an amount you spend from this pool. You can charge this pool by casting spells of 1st level or higher that heal or grant temporary hit points. You gain points to this pool equal to the spells level you casted."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 8,
			"entries": [
				"When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Healing Empowerment",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 10,
			"entries": [
				"At level 10 and 17, your pool of empowerment points will increase by 5 each. This increase is represented in the Empowerment Points column of the Combat Medic table."
				
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 12,
			"entries": [
				"When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Medical Reassurance",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 14,
			"entries": [
				"When you reach 14th level, you gain the ability to stabilize the effectiveness of your healing spell. When you roll 1 or 2 on a spell that grants healing or temporarily hit point, you can reroll those dice, but you must use the new value."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 16,
			"entries": [
				"When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Healing Empowerment",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 17,
			"entries": [
				"At level 10 and 17, your pool of empowerment points will increase by 5 each. This increase is represented in the Empowerment Points column of the Combat Medic table."
				
			]
		},
		{
			"name": "Glyph of Persistence",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 18,
			"entries": [
				"When you reach 18th level, you learn to inscribe a glyph on the body of a creature which keeps their soul and body together for a time. You can spend 10 minutes with a creature to inscribe this glyph onto their body and it will last for 8 hours. Whenever the creature would fall to 0 hit point, the glyph will activate and will prevent it from falling unconscious due to 0 hit point. It still must make death saving throws, and it suffers the normal effects of taking damage while at 0 hit points. However, if it would die due to failing death saving throws, it doesn’t die until the glyph lasts, and it dies then only if it still has 0 hit points. After the activation of the glyph keep track of the damage suffered in negative value. Healing won’t negate this negative health instantly, instead, add the values together as you would track your health, but if you would die due to failed death saves, healing wouldn’t be able to heal you back above 0 hit point. The glyph will stay in effect for an hour after activation and if the creature would reach its maximum hit point in negative value, meaning suffering that much damage, the glyph would lose its effect, due to the creature’s body suffering too much damage and most likely lose parts or receive permanent damage."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 19,
			"entries": [
				"When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Sanctuary of Life",
			"source": "KappaArknights",
			"page": 55,
			"className": "CombatMedic",
			"classSource": "KappaArknights",
			"level": 20,
			"entries": [
				"At 20th level you gain a protective aura. As an action, you create a 60-foot radius aura centered on you, which moves with you. You and creatures of your choice gain the benefits of the aura. The aura lasts 1 minute and can be ended early freely. You can use your Healing Empowerment options on creatures within the aura (no action required) as you would cast a healing spell on them, but you still need to spend the empowerment point for the effects. You can use this ability once and you regain the ability to do so when you finish a long rest. The aura provides the following benefits:",
				{
					"type": "list",
					"items": [
						"Targets receive 15 points of healing at the start of their turn within the aura.",
						"Targets gain resistance against damage inflicted by spells and magical effects.",
						"Targets gain the benefits of half cover.",
						"While the aura is active, having 0 hit points doesn’t knock you unconscious. You still must make death saving throws, and you suffer the normal effects of taking damage while at 0 hit points. However, if you would die due to failing death saving throws, you don’t die until the aura lasts, and you die then only if you still have 0 hit points."
					]
				}
			]
		}
		
	],
	"spell": [
		{
			"name": "CM Healing Word",
			"source": "KappaArknights",
			"page": 60,
			"components": {
				"v": true
			},
			"level": 1,
			"school": "V",
			"time": [{
				"number": 1,
				"unit": "bonus"
			}],
			"range": {
				"type": "point",
				"distance": {
					"amount": 60,
					"type": "feet"
				}
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"A creature of your choice that you can see within range regains {@variantrule Hit Points|PHB} equal to {@damage 1d4 + @mod} + your spellcasting ability modifier. Creatures receiving this healing can use their reaction to stand up if they are prone. This spell has no effect on undead or constructs."
			],
			"entriesHigherLevel": [
			{
				"type": "entries",
				"name": "Using a Higher-Level Spell Slot",
				"entries": [
					"When you cast this spell using a spell slot of 2nd level or higher, the Healing increases by the following way:"
				]
			},
			{
				"type": "table",
				"name": "Using a Higher-Level Spell Slot",
				"colLabels":  [
					"Spellslot",
					"Healing"
				],
				"rows": [
					[
						"2",
						"{@damage 2d4 + @mod}"
					],
					[
						"3",
						"{@damage 3d6 + @mod}"
					],
					[
						"4",
						"{@damage 4d6 + @mod}"
					],
					[
						"5",
						"{@damage 5d8 + @mod}"
					],
					[
						"6",
						"{@damage 6d8 + @mod}"
					],
					[
						"7",
						"{@damage 7d10 + @mod}"
					],
					[
						"8",
						"{@damage 8d10 + @mod}"
					],
					[
						"9",
						"{@damage 9d12 + @mod}"
					]
				]
			}
			]
		},
		{
			"name": "CM Healing Spirit",
			"source": "KappaArknights",
			"page": 60,
			"components": {
				"v": true,
				"s": true
			},
			"level": 2,
			"school": "C",
			"time": [{
				"number": 1,
				"unit": "bonus"
			}],
			"range": {
				"type": "point",
				"distance": {
					"amount": 60,
					"type": "feet"
				}
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1
					}
				}
			],
			"entries": [
				"You call forth a nature spirit to soothe the wounded. The intangible spirit appears in a space that is a 5-foot cube you can see within range. The spirit looks like a transparent beast or fey (your choice).",
				"Until the spell ends, whenever you or a creature you can see moves into the spirit's space for the first time on a turn or starts its turn there, you can cause the spirit to restore {@dice 1d6} + your spellcasting ability modifier hit points to that creature (no action required). The spirit can’t heal constructs or undead.",
				"As a bonus action on your turn, you can move the Spirit up to 30 feet to a space you can see. The spirit can heal a number of times equal to 1 + your spellcasting ability modifier (minimum of twice). After healing that number of times, the spirit disappears."
			],
			"entriesHigherLevel": [
			{
				"type": "entries",
				"name": "Using a Higher-Level Spell Slot",
				"entries": [
					" When you cast this spell using a spell slot of 3rd level or higher, the healing increases {@scaledice 1d6|2-9|1d6} for each slot level above 2nd."
				]
			}
			]
		},
		{
			"name": "CM Aura of Vitality",
			"source": "KappaArknights",
			"page": 60,
			"components": {
				"v": true
				
			},
			"level": 3,
			"school": "V",
			"time": [{
				"number": 1,
				"unit": "action"
			}],
			"range": {
				"type": "radius",
				"distance": {
					"amount": 30,
					"type": "feet"
				}
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1
					},
					"concentration": true
				}
			],
			"entries": [
				"Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain {@dice 2d6} + spell level hit points."
			],
			"entriesHigherLevel": [
			{
				"type": "entries",
				"name": "Using a Higher-Level Spell Slot",
				"entries": [
					"When you cast this spell using a spell slot of 3rd level or higher, the healing increases {@scaledice 1d6|3-9|1d6} for each slot level above 2nd."
				]
			}
			]
		},
		{
			"name": "CM Mass Healing Word",
			"source": "KappaArknights",
			"page": 60,
			"components": {
				"v": true
				
			},
			"level": 3,
			"school": "V",
			"time": [{
				"number": 1,
				"unit": "bonus"
			}],
			"range": {
				"type": "point",
				"distance": {
					"amount": 60,
					"type": "feet"
				}
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to {@dice 1d4 + @mod} + your spellcasting ability modifier. Creatures receiving this healing can use their reaction to stand up if they are prone. Targets healing by this spell gain the effects of the Bless spell until the start of your (the casters) next turn. This spell has no effect on undead or constructs."
			],
			"entriesHigherLevel": [
			{
				"type": "entries",
				"name": "Using a Higher-Level Spell Slot",
				"entries": [
					"When you cast this spell using a spell slot of 4th level or higher, the Healing increases by {@scaledice 1d4|3-9|1d4} for each slot level above 3rd."
				]
			}
			]
		},
		{
			"name": "CM Aura of Life",
			"source": "KappaArknights",
			"page": 60,
			"components": {
				
			},
			"level": 4,
			"school": "A",
			"time": [{
				"number": 1,
				"unit": "action"
			}],
			"range": {
				"type": "radius",
				"distance": {
					"amount": 30,
					"type": "feet"
				}
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1
					},
					"concentration": true
				}
			],
			"entries": [
				"Life-preserving energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each non-hostile creature in the aura (including you) has resistance to necrotic damage, and its hit point maximum can’t be reduced. In addition, a non-hostile, living creature regains {@dice 2d4} + your spellcasting ability modifier hit point when it starts its turn in the aura."
			],
			"entriesHigherLevel": [
			{
				"type": "entries",
				"name": "Using a Higher-Level Spell Slot",
				"entries": [
					"When you cast this spell using a spell slot of 5th level or higher, the Healing increases by {@scaledice 1d4|4-9|1d4} for each slot level above 4rd."
				]
			}
			]
		},
		{
			"name": "CM Mass Cure Wounds",
			"source": "KappaArknights",
			"page": 60,
			"components": {
				
			},
			"level": 5,
			"school": "V",
			"time": [{
				"number": 1,
				"unit": "action"
			}],
			"range": {
				"type": "point",
				"distance": {
					"amount": 60,
					"type": "feet"
				}
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"A wave of healing energy washes out from a point of your choice within range. Choose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to {@dice 3d12} + your spellcasting ability modifier. This spell has no effect on undead or constructs."
			],
			"entriesHigherLevel": [
			{
				"type": "entries",
				"name": "Using a Higher-Level Spell Slot",
				"entries": [
					"When you cast this spell using a spell slot of 6th level or higher, the Healing increases by {@scaledice 1d12|5-9|1d12} + your spellcasting ability modifier for each slot level above 5th."
				]
			}
			]
		}
		
	],
	"optionalfeature": [
		{
			"name": "Darkvision",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:SBS"
			],
			"senses": [{"darkvision": 60}],
			"entries": [
				"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
			]
		},
		{
			"name": "Low Heat Vision",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:SBS"
			],
			"entries": [
				"You can see heat sources originating from objects and creatures within 60 feet of you, allowing you to see invisible creatures if their body temperature is different from the environment. Illusions cannot be distinguished using this trait. This trait ceases to function in sunlight, otherwise it would be too straining for the eyes. This trait is unable to see through obscurement created by particles and spells."
			]
		},
		{
			"name": "Scale Plated Body (Apply Natural Armor Manually)",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:SBS"
			],
			"entries": [
				"Your base AC is 17 (your Dexterity modifier doesn't affect this number). You gain no benefit from wearing armor, but if you are using a shield, you can apply the shield's bonus as normal. Incompatible with Hardened Body."
			]
		},
		{
			"name": "Hardened Body",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:SBS"
			],
			"entries": [
				"You gain +1 to your AC while wearing light or medium armor. Incompatible with Scale Plated Body."
			]
		},
		{
			"name": "Camouflage",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:SBS"
			],
			"entries": [
				"While you are not moving or being moved, you gain +5 to your stealth check. You lose this benefit immediately after you move. In combat, you can benefit from this ability only if you haven't moved since your last turn, and lose it immediately if you move."
			]
		},
		{
			"name": "Amphibian Adaptation",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:SBS"
			],
			"entries": [
				"You gain 30 feet swimming speed and you can hold your breath for up to 1 hour"
			]
		},
		{
			"name": "Adapt Climber",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:SBS"
			],
			"entries": [
				"You gain 30 feet climbing speed."
			]
		},
		{
			"name": "Venomous Bite",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:SBS"
			],
			"entries": [
				"You gain a natural weapon. You are proficient with it and you use your Strength to attack with it. It deals 1d4+Str modifier piercing damage. Once per long rest you can try to poison a creature when you hit with your bite attack. The creature must succeed on a Constitution saving throw or take 3d8 poison damage and is poison for 1 minute. On a success it takes half the poison damage and it isn’t poisoned. The DC is equal to 8 + your proficiency bonus + your Constitution modifier."
			]
		},
		{
			"name": "Darkvision",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"senses": [{"darkvision": 60}],
			"entries": [
				"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
			]
		},
		{
			"name": "Blindsight",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"senses": [{"blindsight": 10}],
			"entries": [
				"You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you."
		]
		},
		{
			"name": "Tremorsense",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"senses": [{"tremorsense": 60}],
			"entries": [
				"You gain the ability to sense vibrations within a 30 feet radius if you are connected to a surface. Using this form of vibrolocation, you can pinpoint exactly where the vibrations originated from. This can be used to identify the location of unseen creatures. If a creature doesn’t move and doesn’t attack or cast a spell on its turn, then tremorsense can no longer detect that creature until it does any of the options mentioned above."
		]
		},
		{
			"name": "Low-Heat Vision",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"entries": [
				"You can see heat sources originating from objects and creatures within 60 feet of you, allowing you to see invisible creatures if their body temperature is different from the environment. Illusions cannot be distinguished using this trait. This trait ceases to function in sunlight, otherwise it would be too straining for the eyes. This trait is unable to see through obscurement created by particles and spells."
		]
		},
		{
			"name": "Precise Perception",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"entries": [
				"Your natural vision is enhanced. You can focus on and see things clearly in a 1 mile radius. You also gain a permanent +2 on your perception checks relying on sight. This feature doesn’t improve your special senses radius, like darkvision, blindsight, etc"
		]
		},
		{
			"name": "Bloodhound Smell",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"entries": [
				"You gain advantage on Survival and Perception check spotting and tracking bloodied (having half of less HP) creatures. If you have advantage on those checks from other sources, this feature grants a +5 bonus on the check instead."
		]
		},
		{
			"name": "Hyper Focused Hearing",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"entries": [
				"You gain advantage on Perception checks that rely on hearing. You can hear creatures' heartbeat within 30 feet of you, and can use this ability to detect lies, giving you a +2 bonus on Insight checks against humanoids within that radius. Creatures suffer a -2 penalty on their stealth checks against you."
		]
		},
		{
			"name": "Enhanced Special Vision",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"entries": [
				"Can be selected multiple times",
				"Your racial special visions range, such as Darkvision, Tremorsense, Blindsight, Low-Heat Vision, Heat Vision and Truesight, increased by an amount equal to their base value, for example if your race grants you Darkvision in a range of 60 feet, this feature increases it range by an additional 60 feet. This feature will increase the range of other racial special senses obtained on later levels as well."
		]
		},
		{
			"name": "Heat Vision",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"prerequisite": [
				{
					"feature": ["Low-Heat Vision"]
				}
			],
			"entries": [
				"Your Low-Heat Vision feature will be replaced by this feature. It will provide the same bonuses as Low-Heat Vision, but you can now use it in direct sunlight as well and can see through obscurement created by spells and particles. Illusions cannot be distinguished using this trait. When you use it in direct sunlight it will have a range of 60 feet, but will have a range of 180 feet in other conditions."
		]
		},
		{
			"name": "Lifespan Extension",
			"source": "KappaArknights",
			"page": 0,
			"featureType": [
				"KAHB:RP"
			],
			"entries": [
				"Your natural lifespan is expanded 5 times of its natural length. Your body won’t get younger, but your aging will slow down accordingly. Your body also gets more resilient against originium. You gain a permanent +2 on your Constitution saving throw against Oripathy. Choosing this feature multiple times will provide the above mentioned benefits again and will also provide additional benefits listed below in phases. (Phase 2 meaning choosing this feature 2 times and so on)",
				{
					"type": "list",
					"items": [
						"Phase 2: Your BOCD score will decrease by 2 x your Constitution modifier on a long rest and Oripathy medication twice as effective on you.",
						"Phase 3: You will only need to roll a Constitution saving throw on every second long rest against Oripathy, but your BOCD score will still decrease on every long rest. You will also gain advantage on Constitution saving throws against Oripathy",
						"Phase 4: You stop aging. You can no longer die naturally and become immune to spells that could age you, unless you are willing. You become proficient in Constitution saving throws, or if you are already proficient in it, you will have advantage on it in every situation. "
					]
				}
			]
		}	
	],
	"foundryOptionalfeature": [
    {
        "name": "Amphibian Adaptation",
        "source": "KappaArknights",
        "effects": [
            {
                "name": "Amphibian Adaptation",
                "changes": [
                    {
                        "key": "data.attributes.movement.swim",
                        "mode": "UPGRADE",
                        "value": "30"
                    }
                ]
            }
        ]
    },
	{
        "name": "Adapt Climber",
        "source": "KappaArknights",
		"effects": [
			{
				"name": "Adapt Climber",
				"changes": [
					{
						"key": "data.attributes.movement.climb",
						"mode": "UPGRADE",
						"value": "30"
					}
				]
			}
			]
    }
	]	
}